iarsystems/ewarm-toshiba-example-projects/TMPM475/Libraries/TX04_Periph_Driver/src/tmpm475_adc.c
/**
 *******************************************************************************
 * @file    tmpm475_adc.c
 * @brief   This file provides API functions for ADC driver.
 * @version V2.0.2.1
 * @date    2015/03/05
 *
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LISENCE AGREEMENT.
 *
 * (C)Copyright TOSHIBA CORPORATION 2015 All rights reserved
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "tmpm475_adc.h"

#if defined(__TMPM475_ADC_H)
/** @addtogroup TX04_Periph_Driver
  * @{
  */

/** @defgroup ADC
  * @brief ADC driver modules
  * @{
  */

/** @defgroup ADC_Private_Defines
  * @{
  */
#define ADC_MASK_KEEP1BIT       ((uint32_t)0x00000001)
#define ADC_MASK_KEEP2BITS      ((uint32_t)0x00000003)
#define ADC_MASK_KEEP3BITS      ((uint32_t)0x00000007)
#define ADC_MASK_KEEP4BITS      ((uint32_t)0x0000000F)
#define ADC_MASK_KEEP5BITS      ((uint32_t)0x0000001F)
#define ADC_MASK_KEEP6BITS      ((uint32_t)0x0000003F)
#define ADC_MASK_KEEP7BITS      ((uint32_t)0x0000007F)
#define ADC_MASK_KEEP8BITS      ((uint32_t)0x000000FF)

#define ADC_TRG_REG_MASK        ((uint32_t)0x000000FF)


#define ADC_MOD3_FIX            ((uint32_t)0x00000000)
//#define ADC_MOD4_FIX            ((uint32_t)0x00000212)
#define ADC_MOD4_FIX            ((uint32_t)0x00000111)
#define ADC_MOD5_FIX            ((uint32_t)0x00006600)

static void proc_xSET(volatile uint32_t * addr, ADC_REGx ResultREGx, uint8_t MacroAINx);

/** @} */
/* End of group ADC_Private_Defines */

/** @defgroup ADC_Private_FunctionPrototypes
  * @{
  */

/** @} */
/* End of group ADC_Private_FunctionPrototypes */

/** @defgroup ADC_Private_Functions
  * @{
  */

static const volatile uint32_t *const ADA_REGx_Address[12U] = {
    &TSB_ADA->REG0, &TSB_ADA->REG1, &TSB_ADA->REG2, &TSB_ADA->REG3,
    &TSB_ADA->REG4, &TSB_ADA->REG5, &TSB_ADA->REG6, &TSB_ADA->REG7,
    &TSB_ADA->REG8, &TSB_ADA->REG9, &TSB_ADA->REG10, &TSB_ADA->REG11
};

static const volatile uint32_t *const ADB_REGx_Address[12U] = {
    &TSB_ADB->REG0, &TSB_ADB->REG1, &TSB_ADB->REG2, &TSB_ADB->REG3,
    &TSB_ADB->REG4, &TSB_ADB->REG5, &TSB_ADB->REG6, &TSB_ADB->REG7,
    &TSB_ADB->REG8, &TSB_ADB->REG9, &TSB_ADB->REG10, &TSB_ADB->REG11
};

static volatile uint32_t *const ADA_PSELx_Address[12U] = {
    &TSB_ADA->PSEL0, &TSB_ADA->PSEL1, &TSB_ADA->PSEL2, &TSB_ADA->PSEL3,
    &TSB_ADA->PSEL4, &TSB_ADA->PSEL5, &TSB_ADA->PSEL6, &TSB_ADA->PSEL7,
    &TSB_ADA->PSEL8, &TSB_ADA->PSEL9, &TSB_ADA->PSEL10, &TSB_ADA->PSEL11
};

static volatile uint32_t *const ADB_PSELx_Address[12U] = {
    &TSB_ADB->PSEL0, &TSB_ADB->PSEL1, &TSB_ADB->PSEL2, &TSB_ADB->PSEL3,
    &TSB_ADB->PSEL4, &TSB_ADB->PSEL5, &TSB_ADB->PSEL6, &TSB_ADB->PSEL7,
    &TSB_ADB->PSEL8, &TSB_ADB->PSEL9, &TSB_ADB->PSEL10, &TSB_ADB->PSEL11
};

static volatile uint32_t *const ADA_PSETx_Address[6U] = {
    &TSB_ADA->PSET0, &TSB_ADA->PSET1, &TSB_ADA->PSET2,
    &TSB_ADA->PSET3, &TSB_ADA->PSET4, &TSB_ADA->PSET5
};

static volatile uint32_t *const ADB_PSETx_Address[6U] = {
    &TSB_ADB->PSET0, &TSB_ADB->PSET1, &TSB_ADB->PSET2,
    &TSB_ADB->PSET3, &TSB_ADB->PSET4, &TSB_ADB->PSET5
};


/** @brief  To do the standard calculation for TSETxy, ASETxy, SSETxy (xy = 03, 47, 811)
  * such as: 
  *      tmp = ADx->TSETxy;
  *      tmp &= ~(0xFF << ((ResultREGx % 4U) * 8U));
  *      tmp |= (uint32_t) MacroAINx << ((ResultREGx % 4U) * 8U);
  *      ADx->TSETxy = tmp;
  *      
  * @param  addr: The address of TSETxy, ASETxy, SSETxy (xy = 03, 47, 811)
  * @param  ResultREGx: refer to same parameter of ADC_SetTimerTrg()
  * @param  MacroAINx: refer to same parameter of ADC_SetTimerTrg()
  * @retval None  
*/
static void proc_xSET(volatile uint32_t * addr, ADC_REGx ResultREGx, uint8_t MacroAINx)
{
    uint32_t tmp = 0U;
    uint32_t shift_bytes = 0U;

    tmp = *addr;
    shift_bytes = ((uint32_t) ResultREGx % 4U) * 8U;    /* == 0, 8, 16, 24 */

    tmp &= (uint32_t) (~(0xFFUL << shift_bytes));       /* clear bytes in uint32_t */
    tmp |= (uint32_t) MacroAINx << shift_bytes;

    *addr = tmp;
}

/** @} */
/* End of group ADC_Private_Functions */


/** @defgroup ADC_Exported_Functions
  * @{
  */

/**
  * @brief  Set ADC prescaler output(SCLK) of the specified ADC unit.
  * @param  ADx: Select ADC unit
  *   This parameter can be one of the following values:
  *   TSB_ADA, TSB_ADB.
  * @param  Sample_HoldTime: Select ADC sample hold time.
  *   This parameter can be one of the following values:
  *   ADC_CONVERSION_CLK_1, ADC_CONVERSION_CLK_2, ADC_CONVERSION_CLK_3,
  *   ADC_CONVERSION_CLK_4, ADC_CONVERSION_CLK_16, ADC_CONVERSION_CLK_64,
  *   ADC_CONVERSION_CLK_128, ADC_CONVERSION_CLK_256, ADC_CONVERSION_CLK_512,
  *   ADC_CONVERSION_CLK_1024.
  * @param  Sample_CLK: Select ADC sample clock time.
  *   This parameter can be one of the following values:
  *   ADC_PHASED_CLK_8, ADC_PHASED_CLK_10, ADC_PHASED_CLK_12, ADC_PHASED_CLK_14,
  *   ADC_PHASED_CLK_16, ADC_PHASED_CLK_18, ADC_PHASED_CLK_20, ADC_PHASED_CLK_22,
  *   ADC_PHASED_CLK_24, ADC_PHASED_CLK_26, ADC_PHASED_CLK_28, ADC_PHASED_CLK_30,
  *   ADC_PHASED_CLK_32, ADC_PHASED_CLK_34, ADC_PHASED_CLK_36, ADC_PHASED_CLK_38,
  *   ADC_PHASED_CLK_40, ADC_PHASED_CLK_42, ADC_PHASED_CLK_44, ADC_PHASED_CLK_46,
  *   ADC_PHASED_CLK_48, ADC_PHASED_CLK_50, ADC_PHASED_CLK_52, ADC_PHASED_CLK_54,
  *   ADC_PHASED_CLK_56, ADC_PHASED_CLK_58, ADC_PHASED_CLK_60, ADC_PHASED_CLK_62,
  *   ADC_PHASED_CLK_64, ADC_PHASED_CLK_66, ADC_PHASED_CLK_68, ADC_PHASED_CLK_70.
  * @param  Prescaler_Output: Select ADC prescaler output.
  *   This parameter can be one of the following values:
  *   ADC_FC_DIVIDE_LEVEL_NONE, ADC_FC_DIVIDE_LEVEL_2, 
  *   ADC_FC_DIVIDE_LEVEL_4, ADC_FC_DIVIDE_LEVEL_8,
  *   ADC_FC_DIVIDE_LEVEL_16
  * @retval None
  * @register The used registers:
  *   ADCCLK<EXAZ[3:0]><VADCLK[2:0]>
  *   ADCMOD4
  *   ADCMOD5
  */
void ADC_SetClk(TSB_AD_TypeDef * ADx, uint32_t Sample_HoldTime, uint32_t Sample_Clk,
                ADC_PRESCALER Prescaler_Output)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_ADC_UNIT(ADx));
    assert_param(IS_ADC_SAMPLEHOLD(Sample_HoldTime));
    assert_param(IS_ADC_PRESCALER(Prescaler_Output));
    assert_param(IS_ADC_CLKPERIOD(Sample_Clk));

