iarsystems/ewarm-toshiba-example-projects/TMPM475/Libraries/TX04_Periph_Driver/src/tmpm475_adc.c
    if (CMPCRx == ADC_CMPCR_0) {
        /* read CMPCR0 then only keep bit4 to bit0, bit11 to bit8 */
        tmp = ADx->CMPCR0 & ((ADC_MASK_KEEP5BITS << 0U) | (ADC_MASK_KEEP4BITS << 8U));
        ADx->CMPCR0 = tmp;
    } else {
        /* read CMPCR1 then only keep bit4 to bit0, bit11 to bit8 */
        tmp = ADx->CMPCR1 & ((ADC_MASK_KEEP5BITS << 0U) | (ADC_MASK_KEEP4BITS << 8U));
        ADx->CMPCR1 = tmp;
    }
}


/**
  * @brief  Get result from the specified AD Conversion Result Register.
  * @param  ADx: Select ADC unit
  *   This parameter can be one of the following values:
  *     TSB_ADA, TSB_ADB
  * @param  ResultREGx: Select which ADC result register will be read.
  *   This parameter can be one of the following values:
  *     ADC_REG0, ADC_REG1, ADC_REG2, ADC_REG3, ADC_REG4, ADC_REG5,
  *     ADC_REG6, ADC_REG7, ADC_REG8, ADC_REG9, ADC_REG10, ADC_REG11
  * @retval A union with AD result and 2 bits extra information.
  *         Refer to the members of ADC_Result in .h file for more detail usage.
  * @register The used registers:
  *   ADCREGn (n can be 0 to 11)   
  */
ADC_Result ADC_GetConvertResult(TSB_AD_TypeDef * ADx, ADC_REGx ResultREGx)
{
    ADC_Result result = { 0U };

    /* Check the parameters */
    assert_param(IS_ADC_UNIT(ADx));
    assert_param(IS_ADC_REGx(ResultREGx));

    /* read out result register wanted */
    /* only keep bit15 to bit0 */
    if (ADx == TSB_ADA) {
        result.All = (*(ADA_REGx_Address[ResultREGx])) & (uint32_t) 0xFFFFU;
    } else {
        result.All = (*(ADB_REGx_Address[ResultREGx])) & (uint32_t) 0xFFFFU;
    }

    return result;
}


/**
  * @brief  Set the program to be started by each of trigger inputs PMD6 to PMD11
  *         of the specified ADC unit.
  * @param  ADx: Select ADC unit
  *   This parameter can be one of the following values:
  *     TSB_ADA, TSB_ADB
  * @param  SELx : Specify the "trigger program number select register"
  *   This parameter can be one of the following values:  
  *     PMD_TRG_PROG_SEL0, PMD_TRG_PROG_SEL1, PMD_TRG_PROG_SEL2,
  *     PMD_TRG_PROG_SEL3, PMD_TRG_PROG_SEL4, PMD_TRG_PROG_SEL5,
  *     PMD_TRG_PROG_SEL6, PMD_TRG_PROG_SEL7, PMD_TRG_PROG_SEL8,
  *     PMD_TRG_PROG_SEL9, PMD_TRG_PROG_SEL10, PMD_TRG_PROG_SEL11
  * @param  MacroProgNum : Program number to be selected, together with its Enabled or Disabled setting through a macro
  *   This parameter must be inputed with macro as the format below:
  *     TRG_ENABLE(x), TRG_DISABLE(x).
  *   'x' above can be one of the following values:
  *     PMD_PROG0, PMD_PROG1, PMD_PROG2,
  *     PMD_PROG3, PMD_PROG4, PMD_PROG5
  * @retval None
  * @register The used register:
  *   ADCPSELn (n can be 0 to 11)
  */
void ADC_SelectPMDTrgProgNum(TSB_AD_TypeDef * ADx, PMD_TRG_PROG_SELx SELx, uint8_t MacroProgNum)
{
    /* Check the parameters */
    assert_param(IS_ADC_UNIT(ADx));
    assert_param(IS_PMD_TRG_PROG_SELx(SELx));
    assert_param(IS_PMD_PROGx_ENABLE_DISABLE(MacroProgNum));
    if (ADx == TSB_ADA) {
        *(ADA_PSELx_Address[SELx]) = (uint32_t) MacroProgNum;
    } else {
        *(ADB_PSELx_Address[SELx]) = (uint32_t) MacroProgNum;
    }
}


/**
  * @brief  Select the interrupt to be generated for each of programs 0 to 5
  *         of the specified ADC unit.
  * @param  ADx: Select ADC unit
  *   This parameter can be one of the following values:
  *     TSB_ADA, TSB_ADB
  * @param  TrgProgINT: The structure containing interrupt configuration for all of PMD Trigger Programs
  *         Refer the members of PMD_TrgProgINTTypeDef in .h file for more detail usage.
  * @retval None
  * @register The used register:
  *   ADCPINTSn (n can be 0 to 5)
  */
void ADC_SetPMDTrgProgINT(TSB_AD_TypeDef * ADx, PMD_TrgProgINTTypeDef * TrgProgINT)
{
    /* Check the parameters */
    assert_param(IS_ADC_UNIT(ADx));
    assert_param(IS_POINTER_NOT_NULL(TrgProgINT));
    assert_param(IS_PMD_INT_NAME(TrgProgINT->INTProg0));
    assert_param(IS_PMD_INT_NAME(TrgProgINT->INTProg1));
    assert_param(IS_PMD_INT_NAME(TrgProgINT->INTProg2));
    assert_param(IS_PMD_INT_NAME(TrgProgINT->INTProg3));
    assert_param(IS_PMD_INT_NAME(TrgProgINT->INTProg4));
    assert_param(IS_PMD_INT_NAME(TrgProgINT->INTProg5));

    /* currently ADxPINTSn is defined as uint32_t */
    ADx->PINTS0 = (uint32_t) TrgProgINT->INTProg0;
    ADx->PINTS1 = (uint32_t) TrgProgINT->INTProg1;
    ADx->PINTS2 = (uint32_t) TrgProgINT->INTProg2;
    ADx->PINTS3 = (uint32_t) TrgProgINT->INTProg3;
    ADx->PINTS4 = (uint32_t) TrgProgINT->INTProg4;
    ADx->PINTS5 = (uint32_t) TrgProgINT->INTProg5;
}


/**
  * @brief  Set PMD Trigger Program Register of the specified ADC unit.
  * @param  ADx: Select ADC unit
  *   This parameter can be one of the following values:
  *     TSB_ADA, TSB_ADB
  * @param  PMDTrg: The structure containing configuration for all of PMD Trigger Program Register 
  *         Refer to the members of PMD_TrgTypeDef in .h file for more detail usage. 
  * @retval None
  * @register The used register:
  *   ADCPSETn (n can be 0 to 5)
  */
void ADC_SetPMDTrg(TSB_AD_TypeDef * ADx, PMD_TrgTypeDef * PMDTrg)
{
    uint32_t tmp = 0U;
    uint32_t dat = 0U;
    /* Check the parameters */
    assert_param(IS_ADC_UNIT(ADx));
    assert_param(IS_POINTER_NOT_NULL(PMDTrg));
    assert_param(IS_PMD_PROGx(PMDTrg->ProgNum));
    assert_param(IS_VE_PHASE(PMDTrg->Reg0_Phase));
    assert_param(IS_VE_PHASE(PMDTrg->Reg1_Phase));
    assert_param(IS_VE_PHASE(PMDTrg->Reg2_Phase));
    assert_param(IS_VE_PHASE(PMDTrg->Reg3_Phase));

    if (ADx == TSB_ADA) {
        assert_param(IS_UNIT_A_AINx(PMDTrg->Reg0_AINx));
        assert_param(IS_UNIT_A_AINx(PMDTrg->Reg1_AINx));
        assert_param(IS_UNIT_A_AINx(PMDTrg->Reg2_AINx));
        assert_param(IS_UNIT_A_AINx(PMDTrg->Reg3_AINx));

        dat = (uint32_t) PMDTrg->Reg0_AINx | ((uint32_t) PMDTrg->Reg0_Phase << 5U);
        tmp |= dat;
        dat = (uint32_t) PMDTrg->Reg1_AINx | ((uint32_t) PMDTrg->Reg1_Phase << 5U);
        tmp |= dat << 8U;
        dat = (uint32_t) PMDTrg->Reg2_AINx | ((uint32_t) PMDTrg->Reg2_Phase << 5U);
        tmp |= dat << 16U;
        dat = (uint32_t) PMDTrg->Reg3_AINx | ((uint32_t) PMDTrg->Reg3_Phase << 5U);
        tmp |= dat << 24U;
        *(ADA_PSETx_Address[PMDTrg->ProgNum]) = tmp;

    } else {
        assert_param(IS_UNIT_B_AINx(PMDTrg->Reg0_AINx));
        assert_param(IS_UNIT_B_AINx(PMDTrg->Reg1_AINx));
        assert_param(IS_UNIT_B_AINx(PMDTrg->Reg2_AINx));
        assert_param(IS_UNIT_B_AINx(PMDTrg->Reg3_AINx));

        dat = (uint32_t) PMDTrg->Reg0_AINx | ((uint32_t) PMDTrg->Reg0_Phase << 5U);
        tmp |= dat;
        dat = (uint32_t) PMDTrg->Reg1_AINx | ((uint32_t) PMDTrg->Reg1_Phase << 5U);
        tmp |= dat << 8U;
        dat = (uint32_t) PMDTrg->Reg2_AINx | ((uint32_t) PMDTrg->Reg2_Phase << 5U);
        tmp |= dat << 16U;
        dat = (uint32_t) PMDTrg->Reg3_AINx | ((uint32_t) PMDTrg->Reg3_Phase << 5U);
        tmp |= dat << 24U;
        *(ADB_PSETx_Address[PMDTrg->ProgNum]) = tmp;
    }
}


/**
  * @brief  Set Timer Trigger Program Register of the specified ADC unit.
  * @param  ADx: Select ADC unit
  *   This parameter can be one of the following values:
  *     TSB_ADA, TSB_ADB
  * @param  ResultREGx: Select which ADC result register will be used for the specified ADC unit.
  *   This parameter can be one of the following values(12 registers):
  *     ADC_REG0, ADC_REG1, ADC_REG2, ADC_REG3, ADC_REG4, ADC_REG5,
  *     ADC_REG6, ADC_REG7, ADC_REG8, ADC_REG9, ADC_REG10, ADC_REG11
  * @param  MacroAINx: Select AD Channel together with its enabled or disabled setting.
  *   This parameter must be inputed with macro as the format below:
  *     TRG_ENABLE(x), TRG_DISABLE(x).
  *     'x¡¯ above can be one of the following values:
  *     For M475 Unit A:
  *          ADC_AIN0, ADC_AIN1, ADC_AIN2, ADC_AIN3, ADC_AIN4,
  *          ADC_AIN5, ADC_AIN6, ADC_AIN7, ADC_AIN8, ADC_AIN9,
  *          ADC_AIN10, ADC_AIN11
  *     For M475 Unit B:
  *          ADC_AIN0 to ADC_AIN10 same as Unit A.        
  * @retval None
  * @register The used registers:
  *   ADCTSETn (n can be 03,47,811)
  */
void ADC_SetTimerTrg(TSB_AD_TypeDef * ADx, ADC_REGx ResultREGx, uint8_t MacroAINx)
{
    /* Check the parameters */
    assert_param(IS_ADC_UNIT(ADx));
    assert_param(IS_ADC_REGx(ResultREGx));

    if (ADx == TSB_ADA) {
        assert_param(IS_UNIT_A_AINx(MacroAINx));
    } else {
        assert_param(IS_UNIT_B_AINx(MacroAINx));
    }

    if (ResultREGx >= ADC_REG8) {
        proc_xSET(&ADx->TSET811, ResultREGx, MacroAINx);
    } else if (ResultREGx >= ADC_REG4) {
        proc_xSET(&ADx->TSET47, ResultREGx, MacroAINx);
    } else {
        proc_xSET(&ADx->TSET03, ResultREGx, MacroAINx);
    }
}


/**
  * @brief  Set Software Trigger Program Register of the specified ADC unit.
  * @param  ADx: Select ADC unit
  *   This parameter can be one of the following values:
  *     TSB_ADA, TSB_ADB
  * @param  ResultREGx: Select which ADC result register will be used for the specified ADC unit.
  *   This parameter can be one of the following values(12 registers):
  *     ADC_REG0, ADC_REG1, ADC_REG2, ADC_REG3, ADC_REG4, ADC_REG5,
  *     ADC_REG6, ADC_REG7, ADC_REG8, ADC_REG9, ADC_REG10, ADC_REG11
  * @param  MacroAINx: Select AD Channel together with its enabled or disabled setting.
  *   This parameter must be inputed with macro as the format below:
  *     TRG_ENABLE(x), TRG_DISABLE(x).
  *     'x¡¯ above can be one of the following values:
  *     For M475 Unit A:
  *          ADC_AIN0, ADC_AIN1, ADC_AIN2, ADC_AIN3, ADC_AIN4,
  *          ADC_AIN5, ADC_AIN6, ADC_AIN7, ADC_AIN8, ADC_AIN9,
  *          ADC_AIN10, ADC_AIN11
  *     For M475 Unit B:
  *          ADC_AIN0 to ADC_AIN10 same as Unit A.
  * @retval None
  * @register The used registers:
  *   ADCSSETn (n can be 03,47,811) 
  */
void ADC_SetSWTrg(TSB_AD_TypeDef * ADx, ADC_REGx ResultREGx, uint8_t MacroAINx)
{
    /* Check the parameters */
    assert_param(IS_ADC_UNIT(ADx));
    assert_param(IS_ADC_REGx(ResultREGx));
    if (ADx == TSB_ADA) {
        assert_param(IS_UNIT_A_AINx(MacroAINx));
    } else {
        assert_param(IS_UNIT_B_AINx(MacroAINx));
    }

    if (ResultREGx >= ADC_REG8) {
        proc_xSET(&ADx->SSET811, ResultREGx, MacroAINx);
    } else if (ResultREGx >= ADC_REG4) {
        proc_xSET(&ADx->SSET47, ResultREGx, MacroAINx);
    } else {
        proc_xSET(&ADx->SSET03, ResultREGx, MacroAINx);
    }
}


/**
  * @brief  Set Constant Trigger Program Register of the specified ADC unit.
  * @param  ADx: Select ADC unit
  *   This parameter can be one of the following values:
  *     TSB_ADA, TSB_ADB
  * @param  ResultREGx: Select which ADC result register will be used for the specified ADC unit.
  *   This parameter can be one of the following values(12 registers):
  *     ADC_REG0, ADC_REG1, ADC_REG2, ADC_REG3, ADC_REG4, ADC_REG5,
  *     ADC_REG6, ADC_REG7, ADC_REG8, ADC_REG9, ADC_REG10, ADC_REG11
  * @param  MacroAINx: Select AD Channel together with its enabled or disabled setting.
  *   This parameter must be inputed with macro as the format below:
  *     TRG_ENABLE(x), TRG_DISABLE(x).
  *     'x¡¯ above can be one of the following values:
  *     For M475 Unit A:
  *          ADC_AIN0, ADC_AIN1, ADC_AIN2, ADC_AIN3, ADC_AIN4,
  *          ADC_AIN5, ADC_AIN6, ADC_AIN7, ADC_AIN8, ADC_AIN9,
  *          ADC_AIN10, ADC_AIN11
  *     For M475 Unit B:
  *          ADC_AIN0 to ADC_AIN10 same as Unit A.
  * @retval None
  * @register The used registers:
  *   ADCASETn (n can be 03,47,811)  
  */
void ADC_SetConstantTrg(TSB_AD_TypeDef * ADx, ADC_REGx ResultREGx, uint8_t MacroAINx)
{
    /* Check the parameters */
    assert_param(IS_ADC_UNIT(ADx));
    assert_param(IS_ADC_REGx(ResultREGx));
    if (ADx == TSB_ADA) {
        assert_param(IS_UNIT_A_AINx(MacroAINx));
    } else {
        assert_param(IS_UNIT_B_AINx(MacroAINx));
    }

    if (ResultREGx >= ADC_REG8) {
        proc_xSET(&ADx->ASET811, ResultREGx, MacroAINx);
    } else if (ResultREGx >= ADC_REG4) {
        proc_xSET(&ADx->ASET47, ResultREGx, MacroAINx);
    } else {
        proc_xSET(&ADx->ASET03, ResultREGx, MacroAINx);
    }
}

/** @} */
/* End of group ADC_Exported_Functions */

/** @} */
/* End of group ADC */

/** @} */
/* End of group TX04_Periph_Driver */

#endif                          /* defined(__TMPM475_ADC_H) */
